<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 10:21
 */

$a = 12;
$b = 5;

/***
我们知道,计算机里的信息,都是以0,1来存储的.
一个可以存储0/1的单元,称为位bit

8个位组成一个字节,Byte,
字节是计算机里最基本的单位.


12 = 8 + 4;
= 1 * 2^3 + 1 * 2^2 + 0 * 2^1 + 0 * 2^0
= 1100

5 =  101


但是计算机里,最基本的单位就是字节,有8个位,只用了3个位怎么办?
答:把用的3个或4个位,写在字节的右边

左边的这些位,用0补上.


因此,计算机里:
12 = 0000 1100
5  = 0000 0101

 ***/


/**
按位运算符

& ,把2个二进制值对齐, 把1看成ture,把0看成false, 然后每个位上都做 并且 的运算 ,
| ,把2个二进制值对齐, 把1看成ture,把0看成false, 然后每个位上都做 或者 的运算 ,
^ ,把2个二进制值对齐, 把1看成ture,把0看成false, 然后每个位上都做 异或 的运算 ,

 **/

/*
12 = 0000 1100
 5 = 0000 0101
----&---------
     0000 0100
12 & 5 = 4;
*/


/*
12 = 0000 1100
 5 = 0000 0101
----|---------
     0000 1101

12 | 5 = 13;
*/


/*
12 = 0000 1100
 5 = 0000 0101
----^---------
     0000 1001

12 ^ 5 = 9;
*/


echo 12 & 5,'<br />',12 | 5,'<br />',12 ^ 5; // 4,13,9

// 提醒大家: 计算机是按位算,我们操作,往往直接10进制
// 大家对二进制有了解即可.不强求深入.