<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 10:21
 */

$a = 12;

/**
$a = 0000 1100;
按位求反


0000 1100
~-----------
1111 0011
 **/


echo ~12;


/***
计算机里表示负数,是用补码的规则来计算的


具体这样来计算负数,假设有8位
最高位是1 得出符号是负

开始补码规则
计算除符号位之外,其他7位的绝对值
()111 0011 = 115;

然后再把 绝对值 - 2^7 = 115 - 128 = -13


因此:

1000 0001 ===>  不要想当然是 -1
而是 1 - 128 = -127

1111 1111 ===>
111 111==127 - 128 = -1


1000 0000 ==> -128
1111 1111 ===> -1
0000 0000 ===> 0
0111 1111 ====> 127

为什么 有人问: -128 +127

直观来理解 -127 -0,+0,+127

 ***/


// 位运算,掌握更好,掌握的不熟悉也不要纠结.