
<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 23:23
 */

// 函数参数与默认值

function sum($x,$y=3,$z=4) {
    return $x + 2*$y + 3*$z;
}


echo sum(1),'<br />';
/**
sum($x,$y=3,$z=4) {
$x = null;
$y = 3;
$z = 4;  // 这3行,是函数声明引起的

$x = 1;  // 这1行,是函数调用,传实参引起的.

return $x + 2*$y + 3*$z;
}
 **/

echo sum(1,2);  // 17
/**
sum($x,$y=3,$z=4) {
$x = null;
$y = 3;
$z = 4;  // 这3行,是函数声明引起的

$x = 1;
$y = 2;   // 这2行,是函数调用,传实参引起的.

return $x + 2*$y + 3*$z;
}
 **/


/***
函数可以设置默认值.

有默认值参数一般后面.

如果某个有默认值的形参,对应位置传了实参
那么,实参的值 将要覆盖 默认值.

 ***/
