<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 23:23
 */

// 函数与变量的作用域

$num = 5;

function t() {
    $num = 9;
}


t();


echo $num,'<br />'; // 5


/**
默认状况下,
PHP中,
函数运行时, 有其自己,独立的变量空间.
函数体内的变量,与外界的变量,无关.

即使是变量的名字相同.
 **/




/**
当函数调用时,系统为其申请一块独立的"调用空间"
函数体内的变量,在其独立的"调用空间内",
与外界的变量无关.

内部叫:局部变量
外部叫:全局变量
 **/

function t2() {
    echo $num;
}

t2();
// 局部内,即t2的空间内,有$num变量吗?
// 没有,虽然全局内有$num,但PHP中,函数并不会去全局寻找$num
// 简单说:PHP函数内的变量,就局限在函数的{}内.






/*
函数调用结束后,申请的独立的"调用空间",就释放掉.
下次,再调用,再申请,函数还得从头初始化.
*/

function t3() {
    $age = 19;
    $age += 1;
    echo $age,'<br />';
}


t3();
t3();
t3();
