<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 8:37
 */


// 完成 圆周与圆面积的计算

// 半径为5
$r = 5;

$s = 2 * 3.14 * $r;
echo $s,'<br />'; // 31.4


$area = 3.14 * $r * $r;
echo $area,'<br />';  // 78.5
include('02.php');

$cube = 4 * 3.14 * $r * $r * $r / 3;
echo $cube,'<br />'; // 166.66666666667


/*
思考:某天科技发展了,PI值不再是3.14,而是3.15
可以把$pi定义一个变量

// 定义变量 $pi,值是3.14

*/

$pi = 3.14;

$r = 5;

$s = 2 * $pi * $r;
echo $s,'<br />'; // 31.4


$area = $pi * $r * $r;
echo $area,'<br />';  // 78.5
include('02.php');

$cube = 4 * $pi * $r * $r * $r / 3;
echo $cube,'<br />'; // 166.66666666667



// 科技进步  PI值变成 3.15 ====//

$pi = 3.15;

$r = 5;

$s = 2 * $pi * $r;
echo $s,'<br />'; // 31.4


$area = $pi * $r * $r;
echo $area,'<br />';  // 78.5
include('02.php');

$cube = 4 * $pi * $r * $r * $r / 3;
echo $cube,'<br />'; // 166.66666666667



include('03.php'); // 当我们引入03的之后,03里把$pi的值,改成10了??
$r = 5;

$s = 2 * $pi * $r;
echo $s,'<br />'; // 31.4


$area = $pi * $r * $r;
echo $area,'<br />';  // 78.5
include('02.php');

$cube = 4 * $pi * $r * $r * $r / 3;
echo $cube,'<br />'; // 166.66666666667




/****************
变量是可以随意赋值的,
$pi,这个重要的变量,被很多公式参考的一个变量.

结果,被其他开发人员,给重赋值了? 影响了所有的公式.

这时,怎么办?


问题很明显: 某个重要的值,如果赋给变量,容易被修改.


解决办法(1):
在入职合同里,写清楚,
如果重赋值$pi,直接开除.


解决办法(2)
想:如果某种量,他的值,一旦定义,就不能修改,那就太好了.
PHP有没有这种好使的东西?
答: 有,常量,常量的值不能修改.
 */

