<?php
/**
 * Created by PhpStorm.
 * User: poerty
 * Date: 2016/5/22
 * Time: 23:16
 */

// 顺序结构
/*
按顺序执行,
*


// 分支结构
// if ,单路分支
// if /else ,双路分支, 双路分支中,if/else中的2个代码段,必有且只有一段被执行.
// if /else if /else if .../ else 多路分支.


// switch case ,用来比较被判断的变量的多种可能值时便于用.


// while循环,
/*
while(表达式) {
    代码段
}

表达式为真,就执行代码段,
执行完代码段,再回去判断表达式.
为真,.....

直到表达式为假的时候,结束循环


do {
    代码段
}while(表达式);

先执行代码段,再判断表达式的真假

// do/while 至少执行一次.


for(语句1;语句2;语句4) {
    语句3;
}

语句1, 先执行,且只执行1次.

然后 语句2 判断,如为真,则执行语句3,然后执行语句4

再

语句2判断..... 循环

直到语句2为假,for结束


*/

// break, continue